In [1]:
import pandas as pd
import numpy as np

# 1. The cumulative sum of a column in DataFrame

In [55]:
df = pd.DataFrame([["A", 1],
                   ["B", 2],
                   ["C", 3],
                   ["D", 4]], columns=["col_A", "col_B"])

df

  col_A  col_B
0     A      1
1     B      2
2     C      3
3     D      4

In [11]:
## start your code below
new_df = ... 
## end your code here

In [4]:
new_df

# 2. Uniquely number individual group in Pandas GroupBy

In [10]:
df = pd.DataFrame([["A", 1], ["B", 2],
                   ["A", 3], ["D", 4]], 
                  columns=["col_A", "col_B"])

df

  col_A  col_B
0     A      1
1     B      2
2     A      3
3     D      4

In [ ]:
## start your code below
new_df = ... 
## end your code here

In [ ]:
new_df

# 3. Check if column has NaN values

In [18]:
df = pd.DataFrame([["A", np.NaN], ["A", 2], ["C", np.NaN], ["D", 4]], 
                  columns=["col_A", "col_B"])

df

  col_A  col_B
0     A    NaN
1     A    2.0
2     C    NaN
3     D    4.0

In [ ]:
## start your code below
col_A_check = ... 
col_B_check = ... 
## end your code here

In [ ]:
col_A_check, col_B_check

# 4. Append a list as a row to a DataFrame

In [21]:
df = pd.DataFrame([["A", 1], ["B", 2],
                   ["C", 3], ["D", 4]], 
                  columns=["col_A", "col_B"])

df

  col_A  col_B
0     A      1
1     B      2
2     C      3
3     D      4

In [22]:
new_row = ["E", 5]

In [25]:
df

  col_A  col_B
0     A      1
1     B      2
2     C      3
3     D      4
4     E      5

In [ ]:
## start your code below
new_df = ... 
## end your code here

In [ ]:
new_df

# 5. Get the first row of every unique value in a column

In [27]:
df = pd.DataFrame([["A", 1], ["B", 2],
                   ["A", 3], ["D", 4]], 
                  columns=["col_A", "col_B"])

df

  col_A  col_B
0     A      1
1     B      2
2     A      3
3     D      4

In [ ]:
## start your code below
new_df = ... 
## end your code here

In [ ]:
new_df

# 6. Identify the source of each row in Pandas Merge

In [33]:
df1 = pd.DataFrame([["A", 1], ["B", 2]], 
                  columns=["col_A", "col_B"])

df2 = pd.DataFrame([["A", 3], ["C", 4]], 
                  columns=["col_A", "col_C"])

df1

  col_A  col_B
0     A      1
1     B      2

In [ ]:
## start your code below
new_df = ... 
## end your code here

In [ ]:
new_df

# 7. Filter n-largest and n-smallest values from a DataFrame

In [37]:
df = pd.DataFrame([["A", 200], ["B", 400],
                   ["C", 100], ["D", 300]], 
                  columns=["col_A", "col_B"])

df

  col_A  col_B
0     A    200
1     B    400
2     C    100
3     D    300

In [54]:
k = 2

In [ ]:
## start your code below
largest_k = ... 
## end your code here

In [ ]:
largest_k

In [ ]:
## start your code below
smallest_k = ... 
## end your code here

In [ ]:
smallest_k

# 8. Map categorical data to unique integral values

In [40]:
df = pd.DataFrame([["A", 1], ["B", 2],
                   ["A", 3], ["D", 4]], 
                  columns=["col_A", "col_B"])

df

  col_A  col_B
0     A      1
1     B      2
2     A      3
3     D      4

In [ ]:
## start your code below
new_df = ... 
## end your code here

In [ ]:
new_df

# 9. Add prefix to every column name

In [46]:
df = pd.DataFrame([["A", 1], ["B", 2],
                   ["C", 3], ["D", 4]], 
                  columns=["col_A", "col_B"])

df

  col_A  col_B
0     A      1
1     B      2
2     C      3
3     D      4

In [ ]:
## start your code below
new_df = ... 
## end your code here

In [ ]:
new_df

# 10. Convert categorical columns to one hot values

In [51]:
df = pd.DataFrame([["A"], ["B"],
                   ["C"], ["A"]], 
                  columns=["col_A"])

df

  col_A
0     A
1     B
2     C
3     A

In [ ]:
## start your code below
new_df = ... 
## end your code here

In [ ]:
new_df